var map = new Map();
// map.set('A0001','success')
map.set('A0002', 'OTP驗證碼已寄到您的手機號碼');
map.set('A0003', 'OTP驗證碼已寄到您的手機號碼與電子信箱');
map.set('E0001', '無效token');
map.set('E0002', 'token不存在');
map.set('E0003', 'token過期');
map.set('E0004', '身份驗證失敗');
map.set('E0005', '欄位檢核錯誤');
map.set('E0006', '欄位不可為空');
map.set(
  'E0007',
  '身分驗證資料有誤，請確認後重新輸入或來電客服專線0800-061-988，將有專人為您服務，謝謝'
);
map.set(
  'E0008',
  'email未留存在安達人壽,請先契約變更新增email，再申請加入會員或洽詢客服專線0800-061-988，將有專人為您服務，謝謝。'
);
map.set(
  'E0009',
  '行動電話驗證異常，請確認後重新輸入或來電客服專線0800-061-988，將有專人為您服務，謝謝。'
);
map.set('E0010', '重覆登入');
map.set('E0011', '身分證格式錯誤');
map.set('E1001', '密碼錯誤');
map.set('E1002', '密碼不符');
map.set('E1003', '密碼未設定');
map.set('E1004', '您輸入的密碼有誤，請重新輸入。您可先參考注意事項的「登入須知」排除問題，謝謝。');
map.set('E1005', '您輸入的密碼已錯誤第n次，請重新輸入。若您密碼輸入錯誤5次，您的帳號將被鎖定。');
map.set(
  'E1006',
  '密碼輸入錯誤5次，您的帳號已被鎖定，請來電客服專線0800-061-988，將有專人為您服務，謝謝。'
);
map.set('E1007', '密碼與再輸入密碼不相同');
map.set('E1008', '驗證碼未輸入');
map.set('E1009', '驗證碼不符');
map.set('E1010', '驗證碼超過時效');
map.set('E1011', 'OTP驗證錯誤');
map.set('E1012', '請輸入正確的OTP驗證碼');
map.set('E1013', '您輸入3次錯誤OTP驗證碼，取消此次申請，您須重新申請');
map.set('E1015', '密碼強度不足，請重新輸入');
map.set('E1016', 'OTP驗證超過時效，請重新發送');
map.set('E1017', '請輸入正確的舊密碼');
map.set('E1018', '密碼與前次密碼相同，請重新輸入');
map.set('E2001', '會員已存在');
map.set('E2002', '會員不存在');
map.set('E2003', 'email重複');
map.set('E2004', '帳戶過期');
map.set('E2005', '帳戶被鎖住');
map.set(
  'E2006',
  '未留存行動電話，無法申請忘記密碼作業，請親洽總公司辦理，或來電0800-061-988，將有專人為您服務，謝謝。'
);
map.set('E2007', '未滿20歲，無法使用本公司服務');
map.set('E2008', '已申請線上變更權限，請點選【忘記密碼】重新設定登入密碼。');
map.set('E2009', '生日輸入錯誤');
map.set('E3001', '檔案上傳失敗');
map.set('E3002', '檔案大小超過限制');
map.set('E3003', '副檔名不符合');
map.set('E4001', 'email格式檢核失敗');
map.set('E4002', '信件寄送失敗');
map.set('E5001', '單日發送OTP已達上限，請明日申請，謝謝');
map.set('E5002', '由於系統中斷，OTP發送失敗，請您選擇繼續申請或取消本次申請，謝謝。');
map.set('E5003', '由於系統中斷，稍後將回到首頁，需請您重新操作，造成您的不便，敬請見諒！');
map.set('E9930', '權限錯誤');
map.set('E9940', '請求參數或方法錯誤');
map.set('E9950', '找不到資源');
map.set('E9999', '系統繁忙，請稍後再操作');

function getErrCode(code) {
  return {
    status: '500',
    errCode: code,
    errMsg: map.get(code),
  };
}

module.exports = { get: getErrCode };
